; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v12 ?v4)
             (pred_12 ?v10 ?v7)
             (pred_2 ?v12 ?v7)
             (pred_7 ?v3 ?v12 )
	     (pred_4 ?v12)
             (pred_5 ?v6)
             (pred_6 ?v10)
             (pred_10 ?v7)
             (pred_11 ?v12)
             (pred_1 ?v10)
             (pred_9 ?v12)
             (pred_8 ))



(:action op_1
:parameters (?v13 ?v1 ?v5 ?v11)
:precondition (and (pred_5 ?v13) (pred_5 ?v1) (pred_6 ?v5) (pred_10 ?v11)
          (pred_3 ?v13 ?v1) (pred_12 ?v5 ?v11)
                   (pred_2 ?v1 ?v11) (pred_4 ?v13) 
                   (pred_11 ?v1) (pred_1 ?v5))
:effect (and  (pred_9 ?v1) (not (pred_11 ?v1))))


(:action op_2
:parameters (?v13 ?v9)
:precondition (and (pred_5 ?v13) (pred_5 ?v9)
               (pred_4 ?v13) (pred_3 ?v13 ?v9) (pred_9 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v13))))

(:action op_5
:parameters (?v13 ?v5)
:precondition (and (pred_5 ?v13) (pred_6 ?v5) 
                  (pred_4 ?v13) (pred_7 ?v5 ?v13) (pred_8 ))
:effect (and (pred_1 ?v5)
   (not (pred_7 ?v5 ?v13)) (not (pred_8 ))))


(:action op_3
:parameters (?v13 ?v8 ?v2)
:precondition (and (pred_5 ?v13) (pred_6 ?v8) (pred_6 ?v2)
                  (pred_4 ?v13) (pred_1 ?v2) (pred_7 ?v8 ?v13))
:effect (and (pred_1 ?v8) (pred_7 ?v2 ?v13)
        (not (pred_1 ?v2)) (not (pred_7 ?v8 ?v13))))

(:action op_4
:parameters (?v13 ?v5)
:precondition (and (pred_5 ?v13) (pred_6 ?v5) 
                  (pred_4 ?v13) (pred_1 ?v5))
:effect (and (pred_8 ) (pred_7 ?v5 ?v13) (not (pred_1 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_05 obj_17 obj_13 obj_09 obj_02 obj_14 obj_07 obj_06 obj_18 obj_20 obj_19 obj_15 obj_04 obj_11 obj_12
    obj_10 obj_16
    obj_03 obj_08
    )

    (:init
       (pred_8)

       (pred_5 obj_01)
       (pred_5 obj_05)
       (pred_5 obj_17)
       (pred_5 obj_13)
       (pred_5 obj_09)
       (pred_5 obj_02)
       (pred_5 obj_14)
       (pred_5 obj_07)
       (pred_5 obj_06)
       (pred_5 obj_18)
       (pred_5 obj_20)
       (pred_5 obj_19)
       (pred_5 obj_15)
       (pred_5 obj_04)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_10 obj_10)
       (pred_10 obj_16)
       (pred_6 obj_03)
       (pred_6 obj_08)

       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_05)
       (pred_3 obj_05 obj_02)
       (pred_3 obj_05 obj_17)
       (pred_3 obj_05 obj_01)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_17 obj_13)
       (pred_3 obj_17 obj_05)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_13 obj_17)
       (pred_3 obj_09 obj_06)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_02 obj_18)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_02 obj_05)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_14 obj_20)
       (pred_3 obj_14 obj_07)
       (pred_3 obj_14 obj_17)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_07 obj_19)
       (pred_3 obj_07 obj_13)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_06 obj_15)
       (pred_3 obj_06 obj_18)
       (pred_3 obj_06 obj_09)
       (pred_3 obj_18 obj_04)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_18 obj_02)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_20 obj_11)
       (pred_3 obj_20 obj_19)
       (pred_3 obj_20 obj_14)
       (pred_3 obj_20 obj_18)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_19 obj_07)
       (pred_3 obj_19 obj_20)
       (pred_3 obj_15 obj_04)
       (pred_3 obj_15 obj_06)
       (pred_3 obj_04 obj_11)
       (pred_3 obj_04 obj_18)
       (pred_3 obj_04 obj_15)
       (pred_3 obj_11 obj_12)
       (pred_3 obj_11 obj_20)
       (pred_3 obj_11 obj_04)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_12 obj_11)
       (pred_11 obj_02)
       (pred_11 obj_09)
       (pred_2  obj_02 obj_10)
       (pred_2  obj_09 obj_16)
       (pred_9 obj_01)
       (pred_9 obj_05)
       (pred_9 obj_17)
       (pred_9 obj_13)
       (pred_9 obj_14)
       (pred_9 obj_07)
       (pred_9 obj_06)
       (pred_9 obj_18)
       (pred_9 obj_20)
       (pred_9 obj_19)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_11)
       (pred_9 obj_12)

       (pred_12  obj_03 obj_10)
       (pred_12  obj_08 obj_16)
       (pred_7 obj_03 obj_07)
       (pred_7 obj_08 obj_20)
       (pred_4 obj_19)
    )

    (:goal (and
       (pred_7 obj_03 obj_05)
       (pred_7 obj_08 obj_15)
    ))
(:constraints
  (always (not (pred_4 obj_14)))
)
)

; plan
1. (op_2 obj_19 obj_07)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_07)
   goals met: 0 of 2
2. (op_5 obj_07 obj_03)
   deleted: (pred_7 obj_03 obj_07) (pred_8)
   added: (pred_1 obj_03)
   goals met: 0 of 2
3. (op_2 obj_07 obj_19)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_19)
   goals met: 0 of 2
4. (op_2 obj_19 obj_20)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_20)
   goals met: 0 of 2
5. (op_2 obj_20 obj_18)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_18)
   goals met: 0 of 2
6. (op_1 obj_18 obj_02 obj_03 obj_10)
   deleted: (pred_11 obj_02)
   added: (pred_9 obj_02)
   goals met: 0 of 2
7. (op_2 obj_18 obj_20)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_20)
   goals met: 0 of 2
8. (op_3 obj_20 obj_08 obj_03)
   deleted: (pred_1 obj_03) (pred_7 obj_08 obj_20)
   added: (pred_1 obj_08) (pred_7 obj_03 obj_20)
   goals met: 0 of 2
9. (op_2 obj_20 obj_18)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_18)
   goals met: 0 of 2
10. (op_2 obj_18 obj_06)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_06)
   goals met: 0 of 2
11. (op_2 obj_06 obj_15)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_15)
   goals met: 0 of 2
12. (op_4 obj_15 obj_08)
   deleted: (pred_1 obj_08)
   added: (pred_8) (pred_7 obj_08 obj_15)
   goals met: 1 of 2
13. (op_2 obj_15 obj_06)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_06)
   goals met: 1 of 2
14. (op_2 obj_06 obj_18)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_18)
   goals met: 1 of 2
15. (op_2 obj_18 obj_20)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_20)
   goals met: 1 of 2
16. (op_5 obj_20 obj_03)
   deleted: (pred_7 obj_03 obj_20) (pred_8)
   added: (pred_1 obj_03)
   goals met: 1 of 2
17. (op_2 obj_20 obj_18)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_18)
   goals met: 1 of 2
18. (op_2 obj_18 obj_02)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_02)
   goals met: 1 of 2
19. (op_2 obj_02 obj_05)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_05)
   goals met: 1 of 2
20. (op_4 obj_05 obj_03)
   deleted: (pred_1 obj_03)
   added: (pred_8) (pred_7 obj_03 obj_05)
   goals met: 2 of 2
